import { useMockAPI } from "@utils/mock/useMockAPI";
import { useEffect } from "react";
import { IQuestionDetails } from "../interfaces/question-details.interface";

export default function useQuestionDetails(questionId: string) {
  const [getQuestionDetails, stats] = useMockAPI<void, IQuestionDetails>({
    delay: 1500,
    handler() {
      return {
        id: 'somefakeid',
        title: 'وارون کلی تابع درجه دو به چه شکله؟',
        author: {
          name: 'اشکان محمدی',
          profileImg: '/imgs/snow-fall.jpg',
          userId: 'ashkanfajwe-8iadjfwid'
        },
        publishDate: new Date(),
        userVote: null,
        content: `
        لورم ایپسوم متن ساختگی با 
        تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه 
        روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
         کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه 
        درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها
         شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در 
        زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه 
        راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای 
        اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
         از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای 
        شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
         کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
         می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری 
        موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.        
        `,
        score: 3423,
        tags: ['test', 'intro', 'fake'],
        comments: [
          {
            author: {
              name: 'اشکان محمدی',
              profileImg: '/imgs/snow-fall.jpg',
              userId: 'ashkanfajwe-8iadjfwid'
            },
            text: 'این یک کامنت است که زیر این پست دارم',
            id: 'comment-fake-id-51',
            publishDate: new Date()
          },
          {
            author: {
              name: 'اشکان محمدی',
              profileImg: '/imgs/snow-fall.jpg',
              userId: 'ashkanfajwe-8iadjfwid'
            },
            text: 'این هم یک نظر دیگر',
            id: 'comment-fake-id-32',
            publishDate: new Date()
          }
        ],
        answers: [
          {
            userVote: 'up',
            accepted: true,
            content: `
              لورم ایپسوم متن ساختگی با 
              تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه 
              روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه 
              درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها
              شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در 
              زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه 
              راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای 
              اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
              از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای 
              شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
              می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی
              و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری 
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            `,
            publishDate: new Date(),
            author: {
              name: 'اشکان محمدی',
              profileImg: '/imgs/snow-fall.jpg',
              userId: 'ashkanfajwe-8iadjfwid'
            },
            score: 59,
            comments: [
              {
                author: {
                  name: 'اشکان محمدی',
                  profileImg: '/imgs/snow-fall.jpg',
                  userId: 'ashkanfajwe-8iadjfwid'
                },
                text: 'عالی بود',
                id: 'comment-fake-id-32',
                publishDate: new Date()
              }
            ]
          },
          {
            userVote: 'down',
            accepted: false,
            content: `
              لورم ایپسوم متن ساختگی با 
              تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه 
              روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
              کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه 
              درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها
              شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در 
              زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه 
              راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای 
              اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
              از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای 
              شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
              می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی
              و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری 
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            `,
            publishDate: new Date(),
            author: {
              name: 'اشکان محمدی',
              profileImg: '/imgs/snow-fall.jpg',
              userId: 'ashkanfajwe-8iadjfwid'
            },
            score: -5,
            comments: [
              {
                author: {
                  name: 'اشکان محمدی',
                  profileImg: '/imgs/snow-fall.jpg',
                  userId: 'ashkanfajwe-8iadjfwid'
                },
                text: 'ببخشید ولی این پاسخ شما هیچ کمکی به پرسشگر سوال نمی کند.',
                id: 'comment-fake-id-32',
                publishDate: new Date()
              }
            ]
          }
        ]
      };
    }
  })

  useEffect(() => {
    getQuestionDetails();
  }, [questionId]);

  return stats;
}